["One man in a French cafe says to the waitress, 'I'd like a cup of coffee, please, with no cream.' The waitress replies, 'I'm sorry, Monsieur, but we're out of cream. How about with no milk?'", "What happens to a frog's car when it breaks down? It gets toad away.", "Why was six scared of seven? Because seven 'ate' nine.", "What is the difference between snowmen and snowwomen? Snowballs.", "What do you call a bear with no teeth? A gummy bear.", "I never wanted to believe that my Dad was stealing from his job as a road worker. But when I got home, all the signs were there.", "How do you make a tissue dance? You put a little boogie in it.", "Why does Snoop Dogg carry an umbrella? FO DRIZZLE!", "Why can’t you hear a pterodactyl in the bathroom? Because it has a silent pee.", "Horse walks into a bar. Bartender says, 'Why the long face?'", "A mushroom walks into a bar. The bartender says, 'Hey, get out of here! We don’t serve mushrooms here'. Mushroom says, 'why not? I’m a fungai!'", "What’s Beethoven’s favorite fruit?…Ba-na-na-naaa!", "What did the little fish say when he swam into a wall? DAM!", "Where does a sheep go for a haircut? To the baaaaa baaaaa shop!", "What does a nosey pepper do? Gets jalapeno business!", "Today I decided to burn a lot of calories...So I lit a fat kid on fire!!!", "If Mexicans are known to sell drugs, what is really in Dora's backpack. I've always thought that girl seemed a little Too happy.", "Men at 26 plays football. Men at 40 plays tennis. Men at 60 plays golf. Have you noticed every time you get older your ball gets smaller?", "World war 2 could have been prevented, if only someone had given Hitler a snickers.", "The clear history button in your browser has saved more lives than Superman.", "Fool me once, shame on you. Fool me twice, shame on me. Fool me three hundred fifty thousand times, you're a weatherman.", "I am a nobody, nobody is perfect, therefore I am perfect.", "I once farted in an elevator, it was wrong on so many levels.", "If con is the opposite of pro, it must mean Congress is the opposite of progress?", "I wondered why the frisbee was getting bigger, and then it hit me.", "I used to like my neighbors, until they put a password on their Wi-Fi.", "What's the difference between a smart man and a stupid man? Nothing. They both think they know everything.", "Never argue with a fool, they will lower you to their level, and then beat you with experience.", "If 4 out of 5 people SUFFER from diarrhea; does that mean that one enjoys it?", "What's the difference between a porcupine and a Porsche? -- The porcupine has the pricks on the outside.", "For anyone who think a woman's place is in the kitchen, remember that's where the knives are kept.", "Light travels faster than sound. This is why some people appear bright until they speak.", "I asked God for a bike, but I know God doesn't work that way. So I stole a bike and asked for forgiveness.", "I say no to alcohol, it just doesn't listen.", "Politicians and diapers have one thing in common. They should both be changed regularly, and for the same reason.", "Why is Christmas just like a day at the office? You do all the work and the fat guy with the suit gets all the credit.", "How can you tell when a lawyer is lying? -- His lips are moving.", "What did the ocean say to the beach? Nothing, it just waved.", "Why did the skeleton go to the party alone? -- He had no body to go with him!"]

